:PROPERTIES:
:ID:       85b20216-7707-4c47-96e9-2eccc110a0c0
:ROAM_ALIASES: routineParser
:END:
#+title: Routine Parser

* Help
:PROPERTIES:
:VISIBILITY: folded
:END:
#+begin_src bash :exports result :results pp
routineParser help
#+end_src

#+RESULTS:
#+begin_example
This is a multi-dispatch command. -h/--help/--help-syntax is available
for top-level/all subcommands. Usage is like:
    cmd {SUBCMD} [subcommand-opts & args]
where subcommand syntaxes are as follows:

  summary [REQUIRED,optional-params]
    Checks if routine is not larger than day
  Options:
      -r=, --routineYaml=  string  REQUIRED  set routineYaml
      -t=, --today=        string  ""        set today

  represent [REQUIRED,optional-params]
    Generates the routine representation in Markdown

    The float hours described at `dayStart` overrides the configuration day
    start
  Options:
      -r=, --routineYaml=  string  REQUIRED  set routineYaml
      -d=, --dayStart=     float   -1.0      set dayStart
      -t=, --today=        string  ""        set today
      --highlightAction    bool    false     set highlightAction

  patchTimetomeRepeatingTasks [REQUIRED,optional-params]
    Patches the timeto.me export file with the routine tasks
  Options:
      -r=, --routineYaml=   string  REQUIRED  set routineYaml
      -t=, --timetomeJson=  string  REQUIRED  set timetomeJson
      -d=, --dayStart=      float   -1.0      set dayStart
      --today=              string  ""        set today

  ganttChart [REQUIRED,optional-params]
    Generates the routine representation in Mermaid Gantt chart

    The float hours described at `dayStart` overrides the configuration day
    start
  Options:
      -r=, --routineYaml=  string  REQUIRED  set routineYaml
      -d=, --dayStart=     float   -1.0      set dayStart
      -t=, --today=        string  ""        set today

  representUnplanned [REQUIRED,optional-params]
    Generates the representation in Markdown of unplanned tasks
  Options:
      -r=, --routineYaml=  string  REQUIRED  set routineYaml
      -t=, --today=        string  ""        set today
#+end_example


* Example
:PROPERTIES:
:VISIBILITY: content
:END:
** Summary
#+begin_src bash :exports both :results pp
echo -n "- "
routineParser summary -r example.yaml --today 2024-10-01 | sed 's/[\(\)]//g' | sed 's/, /\n- /g' # soon it will emit JSON
#+end_src

#+RESULTS:
#+begin_example
- valid: false
- rawNeededHours: 10.61666666666667
- realNeededHours: 12.1
- dayHours: 15.5
- totalStoryPoints: 23
- totalSatisfaction: 26
- totalPositiveBilled: 155.8333333333333
- totalNegativeBilled: -125.0
- totalBilled: 280.8333333333333
- totalBalance: 30.83333333333331
- totalBilledHours: 6.666666666666666
- totalPositiveBilledHours: 6.25
- totalNegativeBilledHours: 0.4166666666666667
- minAverageHourPrice: 42.125
#+end_example

** Markdown
#+begin_src bash :exports both :results pp
routineParser represent -r example.yaml --today 2024-10-01
#+end_src

#+RESULTS:
#+begin_example
## Getting Started (06:00-06:52)
### Exit Bedroom - 0sp0sf0pr10min (06:00-06:10)
- Wake the bed - 3min (06:00-06:03)
- Vest Clothes - 3min (06:04-06:07)
- Drink Water - 1min (06:08-06:09)
- Make the Bed - 3min (06:10-06:13)
### Breakfast - 0sp2sf0pr31min (06:16-06:47)
- Make Coffee - 5min (06:16-06:21)
- Prepare Breakfast - 20min (06:22-06:42)
- Eat - 6min (06:43-06:49)

## Plan Personal Day (06:54-07:26)
### Personal Day Planning - 1sp0sf-300pr25min (06:54-07:19)
- Yesterday Backtrack - 5min (06:54-06:59)
- Review Plans and Tasks - 5min (07:00-07:05)
- Review the Routine - 5min (07:06-07:11)
- Review Past Plan - 5min (07:12-07:17)
- Plan the Day - 5min (07:18-07:23)

## Waking the body (07:28-08:14)
### Morning Exercises - 0sp5sf0pr26min (07:28-07:54)
- Warm Up - 6min (07:28-07:34)
- Calisthenics - 20min (07:35-07:55)
### Morning Bath - 0sp5sf0pr12min (07:58-08:10)
- Prepare to Take Bath - 2min (07:58-08:00)
- Cold Bath - 10min (08:01-08:11)

## Morning Work (08:16-11:59)
### Work Day Planning - 5sp0sf10pr15min (08:16-08:31)
- Analyze Tasks - 5min (08:16-08:21)
- Review Past Plan - 5min (08:22-08:27)
- Write the plan - 5min (08:28-08:33)
### !Morning Work - 5sp0sf30pr200min (08:36-11:56)
- Work Smart - 200min (08:36-11:56)

## Plan the Month (12:01-12:47)
### !Monthly Planning - 1sp3sf0pr40min (12:01-12:41)
- Past Month Reporting - 10min (12:01-12:11)
- Rate the Past Month - 5min (12:12-12:17)
- Check Tasks - 10min (12:18-12:28)
- Write the Plan - 15min (12:29-12:44)

## Third Refection (12:49-13:44)
### Light Lunch - 3sp1sf0pr33min (12:49-13:22)
- Prepare Food - 25min (12:49-13:14)
- Eat - 8min (13:15-13:23)
### !Help Digestion - 3sp0sf0pr15min (13:26-13:41)
- Light Exercises - 15min (13:26-13:41)

## Afternoon Work (13:46-16:40)
### Afternoon Work - 5sp0sf20pr160min (13:46-16:26)
- Work Smarter - 160min (13:46-16:26)
### Finish the Work Day - 0sp0sf0pr7min (16:29-16:36)
- Write Summary - 2min (16:29-16:31)
- Finish the Report - 5min (16:32-16:37)

## Stop the work (16:42-17:25)
### Last Refection - 0sp5sf0pr23min (16:42-17:05)
- Prepare the Food - 15min (16:42-16:57)
- Eat - 8min (16:58-17:06)
### !Last bath - 0sp2sf0pr12min (17:09-17:21)
- Prepare to Take Bath - 2min (17:09-17:11)
- Take Bath - 10min (17:12-17:22)

## Shutting down (17:27-18:04)
### Finish the Day - 0sp0sf0pr10min (17:27-17:37)
- Finish the Personal Report - 10min (17:27-17:37)
### Review Routine - 0sp0sf0pr15min (17:40-17:55)
- Improve and review the routine - 15min (17:40-17:55)
### Patch timetome - 0sp0sf0pr3min (17:58-18:01)
- Patch it with Termux script - 3min (17:58-18:01)
#+end_example
** Represent Unplanned Tasks
#+begin_src bash :exports both :results pp
routineParser representUnplanned -r example.yaml --today 2024-10-01
#+end_src

#+RESULTS:
: - Brew Extra Coffee - 0sp3sf0pr10min
: - Quick Meditation - 0sp2sf0pr6min
** Gantt Chart
#+begin_src bash :exports both :results raw
echo "#+begin_src mermaid :file example.svg"
echo "%%{init: { 'theme': 'dark' } }%%"
routineParser ganttChart -r example.yaml --today 2024-10-01
echo "#+end_src"
#+end_src

#+RESULTS:
#+begin_src mermaid :file example.svg
%%{init: { 'theme': 'dark' } }%%
gantt
  title Routine for 2024-10-01 (0.1.0)
  dateFormat HH:mm
  axisFormat %H:%M

  Day Start : milestone, m1, 06:00, 2m

  section Getting Started
  06.00-06.10 Exit Bedroom - 0sp0sf0pr10min : 06:00, 10m
  06.16-06.47 Breakfast - 0sp2sf0pr31min : 06:16, 31m

  section Plan Personal Day
  06.54-07.19 Personal Day Planning - 1sp0sf-300pr25min : 06:54, 25m

  section Waking the body
  07.28-07.54 Morning Exercises - 0sp5sf0pr26min : 07:28, 26m
  07.58-08.10 Morning Bath - 0sp5sf0pr12min : 07:58, 12m

  section Morning Work
  08.16-08.31 Work Day Planning - 5sp0sf10pr15min : 08:16, 15m
  08.36-11.56 !Morning Work - 5sp0sf30pr200min : 08:36, 200m

  section Plan the Month
  12.01-12.41 !Monthly Planning - 1sp3sf0pr40min : 12:01, 40m

  section Third Refection
  12.49-13.22 Light Lunch - 3sp1sf0pr33min : 12:49, 33m
  13.26-13.41 !Help Digestion - 3sp0sf0pr15min : 13:26, 15m

  section Afternoon Work
  13.46-16.26 Afternoon Work - 5sp0sf20pr160min : 13:46, 160m
  16.29-16.36 Finish the Work Day - 0sp0sf0pr7min : 16:29, 7m

  section Stop the work
  16.42-17.05 Last Refection - 0sp5sf0pr23min : 16:42, 23m
  17.09-17.21 !Last bath - 0sp2sf0pr12min : 17:09, 12m

  section Shutting down
  17.27-17.37 Finish the Day - 0sp0sf0pr10min : 17:27, 10m
  17.40-17.55 Review Routine - 0sp0sf0pr15min : 17:40, 15m
  17.58-18.01 Patch timetome - 0sp0sf0pr3min : 17:58, 3m

  Day End : milestone, m2, 21:30, 2m
#+end_src



* Tasks and TO-DO
- Complete refactor
  - Separate entities from config
  - Move business logic to entities
  - Remove utils module
